tiborsimon/embedded-tdd-headers/pic/pic16/pic16f913_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F913_H_
#define _PIC16F913_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define RA5                           18
#define RA6                           19
#define RA7                           20
#define PORTB                         21
#define RB0                           22
#define RB1                           23
#define RB2                           24
#define RB3                           25
#define RB4                           26
#define RB5                           27
#define RB6                           28
#define RB7                           29
#define PORTC                         30
#define RC0                           31
#define RC1                           32
#define RC2                           33
#define RC3                           34
#define RC4                           35
#define RC5                           36
#define RC6                           37
#define RC7                           38
#define PORTE                         39
#define RE3                           40
#define INTCON                        41
#define RBIF                          42
#define INTF                          43
#define T0IF                          44
#define TMR0IF                        45
#define RBIE                          46
#define INTE                          47
#define T0IE                          48
#define TMR0IE                        49
#define PEIE                          50
#define GIE                           51
#define PIR1                          52
#define TMR1IF                        53
#define TMR2IF                        54
#define CCP1IF                        55
#define SSPIF                         56
#define TXIF                          57
#define RCIF                          58
#define ADIF                          59
#define EEIF                          60
#define PIR2                          61
#define LVDIF                         62
#define LCDIF                         63
#define C1IF                          64
#define C2IF                          65
#define OSFIF                         66
#define T1CON                         67
#define TMR1ON                        68
#define TMR1CS                        69
#define T1SYNC                        70
#define T1INSYNC                      71
#define nT1SYNC                       72
#define T1OSCEN                       73
#define T1CKPS0                       74
#define T1CKPS                        75
#define T1CKPS1                       76
#define T1GE                          77
#define TMR1GE                        78
#define T1GINV                        79
#define T2CON                         80
#define T2CKPS0                       81
#define T2CKPS                        82
#define T2CKPS1                       83
#define TMR2ON                        84
#define TOUTPS0                       85
#define TOUTPS                        86
#define TOUTPS1                       87
#define TOUTPS2                       88
#define TOUTPS3                       89
#define SSPCON                        90
#define SSPM0                         91
#define SSPM                          92
#define SSPM1                         93
#define SSPM2                         94
#define SSPM3                         95
#define CKP                           96
#define SSPEN                         97
#define SSPOV                         98
#define WCOL                          99
#define CCP1CON                       100
#define CCP1M0                        101
#define CCP1M                         102
#define CCP1M1                        103
#define CCP1M2                        104
#define CCP1M3                        105
#define CCP1Y                         106
#define CCP1X                         107
#define RCSTA                         108
#define RCD8                          109
#define RX9D                          110
#define OERR                          111
#define FERR                          112
#define ADDEN                         113
#define CREN                          114
#define SREN                          115
#define RC8_9                         116
#define RC9                           117
#define RX9                           118
#define nRC8                          119
#define SPEN                          120
#define ADCON0                        121
#define ADON                          122
#define nDONE                         123
#define GO_nDONE                      124
#define GO_DONE                       125
#define GO                            126
#define CHS                           127
#define CHS0                          128
#define CHS1                          129
#define CHS2                          130
#define VCFG                          131
#define VCFG0                         132
#define VCFG1                         133
#define ADFM                          134
#define OPTION_REG                    135
#define PS                            136
#define PS0                           137
#define PS1                           138
#define PS2                           139
#define PSA                           140
#define T0SE                          141
#define T0CS                          142
#define INTEDG                        143
#define nRBPU                         144
#define TRISA                         145
#define TRISA0                        146
#define TRISA1                        147
#define TRISA2                        148
#define TRISA3                        149
#define TRISA4                        150
#define TRISA5                        151
#define TRISA6                        152
#define TRISA7                        153
#define TRISB                         154
#define TRISB0                        155
#define TRISB1                        156
#define TRISB2                        157
#define TRISB3                        158
#define TRISB4                        159
#define TRISB5                        160
#define TRISB6                        161
#define TRISB7                        162
#define TRISC                         163
#define TRISC0                        164
#define TRISC1                        165
#define TRISC2                        166
#define TRISC3                        167
#define TRISC4                        168
#define TRISC5                        169
#define TRISC6                        170
#define TRISC7                        171
#define TRISE                         172
#define TRISE3                        173
#define PIE1                          174
#define TMR1IE                        175
#define TMR2IE                        176
#define CCP1IE                        177
#define SSPIE                         178
#define TXIE                          179
#define RCIE                          180
#define ADIE                          181
#define EEIE                          182
#define PIE2                          183
#define LVDIE                         184
#define LCDIE                         185
#define C1IE                          186
#define C2IE                          187
#define OSFIE                         188
#define PCON                          189
#define nBOR                          190
#define nBO                           191
#define nPOR                          192
#define SBOREN                        193
#define OSCCON                        194
#define SCS                           195
#define LTS                           196
#define HTS                           197
#define OSTS                          198
#define IRCF                          199
#define IRCF0                         200
#define IRCF1                         201
#define IRCF2                         202
#define OSCTUNE                       203
#define TUN0                          204
#define TUN                           205
#define TUN1                          206
#define TUN2                          207
#define TUN3                          208
#define TUN4                          209
#define ANSEL                         210
#define ANS0                          211
#define AN                            212
#define AN0                           213
#define ANS1                          214
#define AN1                           215
#define ANS2                          216
#define AN2                           217
#define ANS3                          218
#define AN3                           219
#define ANS4                          220
#define AN4                           221
#define SSPSTAT                       222
#define BF                            223
#define UA                            224
#define R_nW                          225
#define READ_WRITE                    226
#define I2C_READ                      227
#define nW                            228
#define R                             229
#define nWRITE                        230
#define R_W                           231
#define S                             232
#define I2C_START                     233
#define I2C_STOP                      234
#define P                             235
#define nA                            236
#define D_A                           237
#define D_nA                          238
#define D                             239
#define DATA_ADDRESS                  240
#define nADDRESS                      241
#define I2C_DATA                      242
#define CKE                           243
#define SMP                           244
#define WPUB0                         245
#define WPU0                          246
#define WPUB                          247
#define WPUB1                         248
#define WPU1                          249
#define WPUB2                         250
#define WPU2                          251
#define WPUB3                         252
#define WPU3                          253
#define WPUB4                         254
#define WPU4                          255
#define WPUB5                         256
#define WPU5                          257
#define WPUB6                         258
#define WPU6                          259
#define WPUB7                         260
#define WPU7                          261
#define IOCB4                         262
#define IOC4                          263
#define IOCB                          264
#define IOC5                          265
#define IOCB5                         266
#define IOC6                          267
#define IOCB6                         268
#define IOC7                          269
#define IOCB7                         270
#define CMCON1                        271
#define C2SYNC                        272
#define T1GSS                         273
#define TXSTA                         274
#define TXD8                          275
#define TX9D                          276
#define TRMT                          277
#define BRGH                          278
#define SYNC                          279
#define TXEN                          280
#define TX8_9                         281
#define TX9                           282
#define nTX8                          283
#define CSRC                          284
#define CMCON0                        285
#define CM                            286
#define CM0                           287
#define CM1                           288
#define CM2                           289
#define CIS                           290
#define C1INV                         291
#define C2INV                         292
#define C1OUT                         293
#define C2OUT                         294
#define VRCON                         295
#define VR0                           296
#define VR                            297
#define VR1                           298
#define VR2                           299
#define VR3                           300
#define VRR                           301
#define VREN                          302
#define ADCON1                        303
#define ADCS                          304
#define ADCS0                         305
#define ADCS1                         306
#define ADCS2                         307
#define WDTCON                        308
#define SWDTEN                        309
#define SWDTE                         310
#define WDTPS                         311
#define WDTPS0                        312
#define WDTPS1                        313
#define WDTPS2                        314
#define WDTPS3                        315
#define LCDCON                        316
#define LMUX0                         317
#define LMUX                          318
#define LMUX1                         319
#define CS                            320
#define CS0                           321
#define CS1                           322
#define VLCDEN                        323
#define WERR                          324
#define SLPEN                         325
#define LCDEN                         326
#define LCDPS                         327
#define LP                            328
#define LP0                           329
#define LP1                           330
#define LP2                           331
#define LP3                           332
#define WA                            333
#define LCDA                          334
#define BIASMD                        335
#define WFT                           336
#define LVDCON                        337
#define LVDL0                         338
#define LVDL                          339
#define LVDL1                         340
#define LVDL2                         341
#define LVDEN                         342
#define IRVST                         343
#define EEDATL                        344
#define EEDATL0                       345
#define EEDATL1                       346
#define EEDATL2                       347
#define EEDATL3                       348
#define EEDATL4                       349
#define EEDATL5                       350
#define EEDATL6                       351
#define EEDATL7                       352
#define EEADRL                        353
#define EEADRL0                       354
#define EEADRL1                       355
#define EEADRL2                       356
#define EEADRL3                       357
#define EEADRL4                       358
#define EEADRL5                       359
#define EEADRL6                       360
#define EEADRL7                       361
#define EEDATH                        362
#define EEDATH0                       363
#define EEDATH1                       364
#define EEDATH2                       365
#define EEDATH3                       366
#define EEDATH4                       367
#define EEDATH5                       368
#define EEADRH                        369
#define EEADRH0                       370
#define EEADRH1                       371
#define EEADRH2                       372
#define EEADRH3                       373
#define EEADRH4                       374
#define LCDDATA0                      375
#define SEG0COM0                      376
#define LCDDATA0_SEG0                 377
#define S0C0                          378
#define LCDDATA0_SEG1                 379
#define SEG1COM0                      380
#define S1C0                          381
#define LCDDATA0_SEG2                 382
#define S2C0                          383
#define SEG2COM0                      384
#define SEG3COM0                      385
#define LCDDATA0_SEG3                 386
#define S3C0                          387
#define LCDDATA0_SEG4                 388
#define SEG4COM0                      389
#define S4C0                          390
#define LCDDATA0_SEG5                 391
#define S5C0                          392
#define SEG5COM0                      393
#define SEG6COM0                      394
#define LCDDATA0_SEG6                 395
#define S6C0                          396
#define SEG7COM0                      397
#define LCDDATA0_SEG7                 398
#define S7C0                          399
#define LCDDATA1                      400
#define LCDDATA1_SEG8                 401
#define S8C0                          402
#define SEG8COM0                      403
#define LCDDATA1_SEG9                 404
#define S9C0                          405
#define SEG9COM0                      406
#define LCDDATA1_SEG10                407
#define SEG10COM0                     408
#define S10C0                         409
#define LCDDATA1_SEG11                410
#define S11C0                         411
#define SEG11COM0                     412
#define LCDDATA1_SEG12                413
#define S12C0                         414
#define SEG12COM0                     415
#define S13C0                         416
#define LCDDATA1_SEG13                417
#define SEG13COM0                     418
#define S14C0                         419
#define LCDDATA1_SEG14                420
#define SEG14COM0                     421
#define SEG15COM0                     422
#define LCDDATA1_SEG15                423
#define S15C0                         424
#define LCDDATA3                      425
#define SEG0COM1                      426
#define LCDDATA3_SEG0                 427
#define S0C1                          428
#define LCDDATA3_SEG1                 429
#define SEG1COM1                      430
#define S1C1                          431
#define LCDDATA3_SEG2                 432
#define S2C1                          433
#define SEG2COM1                      434
#define SEG3COM1                      435
#define LCDDATA3_SEG3                 436
#define S3C1                          437
#define SEG4COM1                      438
#define LCDDATA3_SEG4                 439
#define S4C1                          440
#define LCDDATA3_SEG5                 441
#define S5C1                          442
#define SEG5COM1                      443
#define LCDDATA3_SEG6                 444
#define SEG6COM1                      445
#define S6C1                          446
#define LCDDATA3_SEG7                 447
#define SEG7COM1                      448
#define S7C1                          449
#define LCDDATA4                      450
#define S8C1                          451
#define SEG8COM1                      452
#define LCDDATA4_SEG8                 453
#define S9C1                          454
#define SEG9COM1                      455
#define LCDDATA4_SEG9                 456
#define LCDDATA4_SEG10                457
#define SEG10COM1                     458
#define S10C1                         459
#define LCDDATA4_SEG11                460
#define S11C1                         461
#define SEG11COM1                     462
#define LCDDATA4_SEG12                463
#define S12C1                         464
#define SEG12COM1                     465
#define S13C1                         466
#define LCDDATA4_SEG13                467
#define SEG13COM1                     468
#define S14C1                         469
#define LCDDATA4_SEG14                470
#define SEG14COM1                     471
#define SEG15COM1                     472
#define S15C1                         473
#define LCDDATA4_SEG15                474
#define LCDDATA6                      475
#define SEG0COM2                      476
#define LCDDATA6_SEG0                 477
#define S0C2                          478
#define LCDDATA6_SEG1                 479
#define SEG1COM2                      480
#define S1C2                          481
#define LCDDATA6_SEG2                 482
#define S2C2                          483
#define SEG2COM2                      484
#define SEG3COM2                      485
#define LCDDATA6_SEG3                 486
#define S3C2                          487
#define SEG4COM2                      488
#define LCDDATA6_SEG4                 489
#define S4C2                          490
#define S5C2                          491
#define LCDDATA6_SEG5                 492
#define SEG5COM2                      493
#define SEG6COM2                      494
#define S6C2                          495
#define LCDDATA6_SEG6                 496
#define SEG7COM2                      497
#define LCDDATA6_SEG7                 498
#define S7C2                          499
#define LCDDATA7                      500
#define LCDDATA7_SEG8                 501
#define S8C2                          502
#define SEG8COM2                      503
#define S9C2                          504
#define SEG9COM2                      505
#define LCDDATA7_SEG9                 506
#define SEG10COM2                     507
#define S10C2                         508
#define LCDDATA7_SEG10                509
#define S11C2                         510
#define LCDDATA7_SEG11                511
#define SEG11COM2                     512
#define S12C2                         513
#define LCDDATA7_SEG12                514
#define SEG12COM2                     515
#define S13C2                         516
#define SEG13COM2                     517
#define LCDDATA7_SEG13                518
#define S14C2                         519
#define SEG14COM2                     520
#define LCDDATA7_SEG14                521
